pwbf/RX64M_ETHERNET/r_tfat_driver_rx/src/r_tfat_drv_if.c
#endif // (TFAT_USB_MINI_DRIVE_NUM > 0)


#ifndef DRV0_DEV_CH
#define DRV0_DEV_CH  (0)
#endif
#ifndef DRV1_DEV_CH
#define DRV1_DEV_CH  (0)
#endif
#ifndef DRV2_DEV_CH
#define DRV2_DEV_CH  (0)
#endif
#ifndef DRV3_DEV_CH
#define DRV3_DEV_CH  (0)
#endif
#ifndef DRV4_DEV_CH
#define DRV4_DEV_CH  (0)
#endif
#ifndef DRV5_DEV_CH
#define DRV5_DEV_CH  (0)
#endif
#ifndef DRV6_DEV_CH
#define DRV6_DEV_CH  (0)
#endif
#ifndef DRV7_DEV_CH
#define DRV7_DEV_CH  (0)
#endif
#ifndef DRV8_DEV_CH
#define DRV8_DEV_CH  (0)
#endif
#ifndef DRV9_DEV_CH
#define DRV9_DEV_CH  (0)
#endif

#define TFAT_DRIVE_ALLOC_NUM_MAX    (TFAT_DRIVE_NUM_MAX)

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
*******************************************************************************/
static uint8_t drive_alloc_tbl[TFAT_DRIVE_ALLOC_NUM_MAX][2] =
{
    { TFAT_DRIVE_ALLOC_NUM_0, DRV0_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_1, DRV1_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_2, DRV2_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_3, DRV3_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_4, DRV4_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_5, DRV5_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_6, DRV6_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_7, DRV7_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_8, DRV8_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_9, DRV9_DEV_CH },
};



/*  Real Time Clock - Time set to 23 FEB 2009 15:02:20  */
static uint8_t usb_ghmsc_rtcYear = 109;
static uint8_t usb_ghmsc_rtcMon  = 2;
static uint8_t usb_ghmsc_rtcMday = 23;
static uint8_t usb_ghmsc_rtcHour = 15;
static uint8_t usb_ghmsc_rtcMin  = 2;
static uint8_t usb_ghmsc_rtcSec  = 20;

/******************************************************************************
* Function Name : check_use_usb
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_USB_DRIVE_NUM > 0)
static uint8_t check_use_usb(uint8_t drive)
{
    return ( ( (TFAT_DRIVE_USB_ALLOC & (0x01 << drive) ) != 0) ?  0x01 : 0x00);
}
#endif // USE_USB

/******************************************************************************
* Function Name : chk_use_sdhi
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_SDHI_DRIVE_NUM > 0)
static uint8_t chk_use_sdhi(uint8_t drive)
{
    return ( ( (TFAT_DRIVE_SDHI_ALLOC & (0x01 << drive) ) != 0) ?  0x01 : 0x00);
}
#endif // USE_SDHI

/******************************************************************************
* Function Name : chk_use__mmc
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if TFAT_MMC_DRIVE_NUM > 0
static uint8_t chk_use__mmc(uint8_t drive)
{
    return ( ( (TFAT_DRIVE_MMC_ALLOC & (0x01 << drive) ) != 0) ?  0x01 : 0x00);
}
#endif // USE_MMC

/******************************************************************************
* Function Name : check_use_usb_mini
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_USB_MINI_DRIVE_NUM > 0)
static uint8_t check_use_usb_mini(uint8_t drive)
{
    return ( ( (TFAT_DRIVE_USB_MINI_ALLOC & (0x01 << drive) ) != 0) ?  0x01 : 0x00);
}
#endif // USE_USB

/******************************************************************************
* Function Name : R_tfat_disk_initialize
* Description   : This function initializes the memory medium
*               :    for file operations
* Arguments     : uint8_t  drive        : Physical drive number for FIT module
* Return value  : Status of the memory medium
******************************************************************************/
DSTATUS R_tfat_disk_initialize(uint8_t drive)
{
    DSTATUS ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( check_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_initialize( drive_alloc_tbl[drive][1] ); /* function for USB */
    }
#endif

#if (TFAT_SDHI_DRIVE_NUM > 0)
    if ( chk_use_sdhi(drive) )
    {
        ret = R_tfat_sdhi_disk_initialize( drive_alloc_tbl[drive][1] ); /* function for SDHI */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( check_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_initialize( drive_alloc_tbl[drive][1] ); /* function for USB Mini */
    }
#endif

    return  ret;
}

/******************************************************************************
* Function Name : R_tfat_disk_read
* Description   : This function reads data from the specified location
*               :    of the memory medium
* Arguments     : uint8_t  drive        : Physical drive number
*               : uint8_t* buffer       : Pointer to the read data buffer
*               : uint32_t sector_number : uint32_t SectorNumber
*               : uint8_t sector_count   : Number of sectors to read
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_disk_read (
    uint8_t drive,          /* Physical drive number             */
    uint8_t* buffer,        /* Pointer to the read data buffer   */
    uint32_t sector_number, /* Start sector number               */
    uint8_t sector_count    /* Number of sectors to read         */
)
{
    DRESULT ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( check_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_read( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB */
    }
#endif

#if (TFAT_SDHI_DRIVE_NUM > 0)
    if ( chk_use_sdhi(drive) )
    {
        ret = R_tfat_sdhi_disk_read( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for SDHI */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( check_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_read( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB Mini */
    }
#endif

    return ret;
}

