pwbf/RX64M_ETHERNET/r_tfat_driver_rx/src/r_tfat_drv_if.c
/******************************************************************************
* Function Name : R_tfat_disk_write
* Description   : This function writes data to a specified location
*               :    of the memory medium
* Arguments     : uint8_t Drive : Physical drive number
*               : const uint8_t* buffer       : Pointer to the write data
*               : uint32_t       sector_number : Sector number to write
*               : uint8_t        sector_count  : Number of sectors to write
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_disk_write (
    uint8_t drive,           /* Physical drive number           */
    const uint8_t* buffer,   /* Pointer to the write data       */
    uint32_t sector_number,  /* Sector number to write          */
    uint8_t sector_count     /* Number of sectors to write      */
)
{
    DRESULT ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( check_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_write( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB */
    }
#endif

#if (TFAT_SDHI_DRIVE_NUM > 0)
    if ( chk_use_sdhi(drive) )
    {
        ret = R_tfat_sdhi_disk_write( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for SDHI */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( check_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_write( drive_alloc_tbl[drive][1], buffer, sector_number, sector_count ); /* function for USB Mini */
    }
#endif

    return ret;
}

/******************************************************************************
* Function Name : R_tfat_disk_ioctl
* Description   : This function is used to execute memory operations
*               :    other than read\write
* Arguments     : uint8_t drive   : Drive number
*               : uint8_t command : Control command code
*               : void*   buffer  : Data transfer buffer
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_disk_ioctl (
    uint8_t drive,           /* Drive number             */
    uint8_t command,         /* Control command code     */
    void* buffer             /* Data transfer buffer     */
)
{
    DRESULT ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( check_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_ioctl( drive_alloc_tbl[drive][1], command, buffer ); /* function for USB */
    }
#endif

#if (TFAT_SDHI_DRIVE_NUM > 0)
    if ( chk_use_sdhi(drive) )
    {
        ret = R_tfat_sdhi_disk_ioctl ( drive_alloc_tbl[drive][1], command, buffer ); /* function for SDHI */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( check_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_ioctl( drive_alloc_tbl[drive][1], command, buffer ); /* function for USB Mini */
    }
#endif

    return ret;
}

/******************************************************************************
* Function Name : R_tfat_disk_status
* Description   : This function is used to retrieve the current status
*               :    of the disk
* Arguments     : uint8_t drive : Physical drive number
* Return value  : Status of the disk
******************************************************************************/
DSTATUS R_tfat_disk_status (
    uint8_t drive             /* Physical drive number    */
)
{
    DSTATUS ret = TFAT_RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( check_use_usb(drive) )
    {
        ret = R_tfat_usb_disk_status ( drive_alloc_tbl[drive][1] ); /* function for USB */
    }
#endif

#if (TFAT_SDHI_DRIVE_NUM > 0)
    if ( chk_use_sdhi(drive) )
    {
        ret = R_tfat_sdhi_disk_status ( drive_alloc_tbl[drive][1] ); /* function for SDHI */
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( check_use_usb_mini(drive) )
    {
        ret = R_tfat_usb_mini_disk_status ( drive_alloc_tbl[drive][1] ); /* function for USB Mini */
    }
#endif

    return ret;
}

/******************************************************************************
* Function Name : R_tfat_get_fattime
* Description   : This function returns the current date and time
* Arguments     : none
* Return value  : uint32_t
* NOTE          : Please DO NOT modify this function. This function
*               :    is used by the FAT library to get the current date
                :    and time during file manipulations.
******************************************************************************/
uint32_t R_tfat_get_fattime (void)
{
    uint32_t tmr;

    /* Disable interrupts   */
    R_BSP_InterruptsDisable();

    /* Convert the time to store in FAT entry   */
    tmr =   (((uint32_t)usb_ghmsc_rtcYear - 80) << 25);
    tmr |=  ((uint32_t)usb_ghmsc_rtcMon << 21);
    tmr |=  ((uint32_t)usb_ghmsc_rtcMday << 16);
    tmr |=  ((uint32_t)usb_ghmsc_rtcHour << 11);
    tmr |=  ((uint32_t)usb_ghmsc_rtcMin << 5);
    tmr |=  ((uint32_t)usb_ghmsc_rtcSec >> 1);

    /* Enable interrupts    */
    R_BSP_InterruptsEnable();

    return tmr;
}

/******************************************************************************
* Function Name : R_tfat_drv_change_alloc
* Description   : This function is used to change drive allocation.
*               :    of the disk
* Arguments     : TFAT_DRV_NUM      tfat_drv : Physical drive number( in TFAT)
*               : uint8_t dev_type           : device define
*               : uint8_t dev_drv_num        : drive number/device channnel( in device driver)
* Return value  : Result of function execution
******************************************************************************/
DRESULT R_tfat_drv_change_alloc(TFAT_DRV_NUM tfat_drv, uint8_t dev_type, uint8_t dev_drv_num )
{
    if ( TFAT_DRIVE_ALLOC_NUM_MAX <= tfat_drv )
    {
        return TFAT_RES_ERROR;
    }

#if (TFAT_USB_DRIVE_NUM > 0)
    if ( TFAT_CTRL_USB == dev_type )
    {
        TFAT_DRIVE_USB_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_USB_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_SDHI_DRIVE_NUM > 0)
    if ( TFAT_CTRL_SDHI == dev_type )
    {
        TFAT_DRIVE_SDHI_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_SDHI_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_MMC_DRIVE_NUM > 0)
    if ( TFAT_CTRL_MMC == dev_type )
    {
        TFAT_DRIVE_MMC_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_MMC_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if ( TFAT_CTRL_USB_MINI == dev_type )
    {
        TFAT_DRIVE_USB_MINI_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_USB_MINI_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif

    drive_alloc_tbl[tfat_drv][0] = dev_type;
    drive_alloc_tbl[tfat_drv][1] = dev_drv_num;

    return TFAT_RES_OK;
}

/*******************************************************************************
End  of file
*******************************************************************************/
